/**
 * メッセージ管理
 */
const messages = Object.freeze({
  MSGE001: "検索に失敗しました",
  MSGI002: "検索結果がありません",
  MSGI003: "登録に成功しました",
  MSGE004: "登録に失敗しました",
  MSGI005: "{0}を削除しますか？",
  MSGI006: "削除に成功しました",
  MSGE007: "削除に失敗しました",
  MSGE008: "{0}は{1}桁で入力してください",
  MSGE009: "{0}は半角英数で入力してください",
  MSGE010: "{0}は{1}文字以内で入力してください",
  MSGE011: "{0}は半角数字で入力してください",
  MSGE012: "{0}は{1}桁以内で入力してください",
  MSGE013: "正しい日付を入力してください",
  MSGE015: "{0}はxxx-xxxx-xxxxで入力してください",
  MSGE016: "{0}は{1}以上で入力してください",
  MSGE017: "{0}は{1}以降の日付を入力してください",
  MSGE018: "{0}が存在しません",
  MSGE019: "入力された{0}は存在しません",
});

export default messages;
